Revit 2018 API
MultiReferenceAnnotationOptions Members
The MultiReferenceAnnotationOptions type exposes the following members.
Constructors
Name | Description
MultiReferenceAnnotationOptions
 Create an instance of Multi-Reference Annotation Options set with default values.
Methods
Name | Description
Dispose
Releases all resources used by the MultiReferenceAnnotationOptions
ElementsMatchReferenceCategory
 Verifies that all of the elements match the reference category required by the MultiReferenceAnnotationType.
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetElementsToDimension
 Gets the elements which the dimension will witness.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsAllowedDimensionStyleType
 Only Linear and LinearFixed dimension style types are allowed for new MultiReferenceAnnotations.
SetElementsToDimension
 Sets the elements which the dimension will witness.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
DimensionLineDirection
 The direction vector of the dimension line.
DimensionLineOrigin
 The origin point for the dimension line.
DimensionPlaneNormal
 The normal vector to the dimension plane.
DimensionStyleType
 The dimension style type to be used by the new MultiReferenceAnnotation.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
MultiReferenceAnnotationType
 The MultiReferenceAnnotationType to be used by the new MultiReferenceAnnotation.
TagHasLeader
 When true the tag will be created with an attached leader. When false the tag will be created without a leader.
TagHeadPosition
 The position for the tag's head.
See Also
MultiReferenceAnnotationOptions Class
Autodesk.Revit.DB Namespace